---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.MaterialGauge
source: html/0392e62d-e827-522a-9c4f-39efd42b0b16.htm
---
# Autodesk.Revit.DB.FabricationPart.MaterialGauge Property

The fabrication material gauge identifier.

## Syntax (C#)
```csharp
public int MaterialGauge { get; }
```